app/controllers/pics_controller.rb

SELECT "pics".* FROM "pics" ORDER BY created_at Desc
---
    def index
        @pics = Pic.all.order("created_at DESC")

INSERT INTO "pics" ("title", "discription", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "dc"], ["discription", "dscs"], ["created_at", "2018-03-16 06:31:45.772509"], ["updated_at", "2018-03-16 06:31:45.772509"], ["user_id", 1]]
---
    def create
        @pic = current_user.pics.build(pic_params)

        if @pic.save

UPDATE "pics" SET "title" = ?, "discription" = ?, "updated_at" = ? WHERE "pics"."id" = ?  [["title", "second"], ["discription", "edited"], ["updated_at", "2018-03-13 08:24:09.689095"], ["id", 2]]
---
    def update
        if @pic.update(pic_params)

DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 2]]
---
    def destroy
        @pic.destroy

SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def find_pic
        @pic = Pic.find(params[:id])